# Integrating SQL and Python

## Step 1: Install the Required Libraries

In [2]:
pip install pymysql

Requirement already satisfied: pymysql in c:\users\khushi\anaconda3\lib\site-packages (1.1.1)
Note: you may need to restart the kernel to use updated packages.

## Step 2: Import Libraries and Connect to MySQL

In [3]:
import pymysql
import pandas as pd

# Connect to MySQL database
connection = pymysql.connect(
    host='localhost',  # Replace with your host
    user='root',  # Replace with your username
    password='',  # Replace with your password
    database=''  # Replace with your database name
)

cursor = connection.cursor()

## Step 3: Execute Queries and Fetch Data

In [9]:
# Select all records from the employees table
select_query = """SELECT employee_id, first_name, last_name, email, department_id,salary 
FROM employees """
cursor.execute(select_query)
rows = cursor.fetchall()

# Convert to a DataFrame for better readability
df = pd.DataFrame(rows, columns=['employee_id', 'first_name', 'last_name', 'email', 'department_id', 'salary'])
df.head()

,employee_id,first_name,last_name,email,department_id,salary
0,1,John,Doe,john.doe@example.com,10,60000.00
1,2,Jane,Smith,jane.smith@example.com,20,75000.00
2,3,David,Lee,david.lee@example.com,10,55000.00
3,4,Sarah,Jones,sarah.jones@example.com,30,80000.00
4,5,Michael,Brown,michael.brown@example.com,20,65000.00

## Step 4: Automate ETL Processes
* Here's a simple ETL (Extract, Transform, Load) example:

    * Extract data from the database
    * Transform the data (e.g., increase salaries by 10%)
    * Load the data back into the database (update salaries)

In [15]:
# Extract data
extract_query = 'SELECT employee_id, salary FROM employees'
cursor.execute(extract_query)
employees = cursor.fetchall()

# Transform data (increase salary by 10%)
updated_salaries = [(salary * 1.10, emp_id) for emp_id, salary in employees]

# Load data (update salaries in the database)
update_query = 'UPDATE employees SET salary = %s WHERE employee_id = %s'
cursor.executemany(update_query, updated_salaries)

# Commit the changes
# connection.commit()

# Verify the update
cursor.execute(select_query)
rows = cursor.fetchall()

# Convert to a DataFrame for better readability
df = pd.DataFrame(rows, columns=['employee_id', 'first_name', 'last_name', 'email', 'department_id', 'salary'])
df.head()

,employee_id,first_name,last_name,email,department_id,salary
0,1,John,Doe,john.doe@example.com,10,72600.0
1,2,Jane,Smith,jane.smith@example.com,20,90750.0
2,3,David,Lee,david.lee@example.com,10,66550.0
3,4,Sarah,Jones,sarah.jones@example.com,30,96800.0
4,5,Michael,Brown,michael.brown@example.com,20,78650.0

## Functions

### Numeric Functions

In [ ]:
# ABS: Returns the absolute value of a number

# AVG: Returns the average value of an expression

# CEIL: Returns the smallest integer value that is >= to a number

# COUNT: Returns the number of records returned by a select query

# FLOOR:  Returns the largest integer value that is <= to a number

# MAX: Returns the maximum value in a set of values

In [20]:
# COUNT: Returns the number of records returned by a select query
select_query = """SELECT COUNT(*) AS number_of_employees FROM Employees"""
cursor.execute(select_query)
rows = cursor.fetchall()

print(rows)

((20,),)